I could reproduce the issue.

Module before changes:
```
provider "google" {
  project = var.project
}

provider "google-beta" {
  project = var.project
}

data "google_container_engine_versions" "default" {
  provider       = google-beta
  for_each       = var.clusters
  location       = each.value.zone
  version_prefix = each.value.version_prefix
}

resource "google_container_cluster" "gke_cluster" {
  for_each = var.clusters

  name     = "${var.env}-ibp-${each.value.name}-cluster"
  project  = var.project
  location = each.value.zone

  min_master_version = data.google_container_engine_versions.default[each.key].latest_node_version
  release_channel {
    channel = "UNSPECIFIED"
  }

  remove_default_node_pool = true
  initial_node_count       = var.initial_node_count

  network    = var.env
  subnetwork = "${var.env}-subnet-${each.value.name}"

  ip_allocation_policy {
    cluster_secondary_range_name  = "${var.env}-subnet-${each.value.name}-sec-01"
    services_secondary_range_name = "${var.env}-subnet-${each.value.name}-sec-02"
  }
}

resource "google_container_node_pool" "node_pool" {
  for_each = var.clusters

  name_prefix = "${var.env}-ibp-${each.value.name}-"
  project    = var.project
  location   = each.value.zone
  cluster    = google_container_cluster.gke_cluster[each.key].name
  node_count = var.initial_node_count
  version    = data.google_container_engine_versions.default[each.key].latest_node_version

  lifecycle {
    ignore_changes        = [node_count]
    create_before_destroy = true
  }

  node_config {
    preemptible  = var.preemptible_nodes
    machine_type = var.machine_type

    metadata = {
      disable-legacy-endpoints = "true"
    }

    oauth_scopes = [
      "https://www.googleapis.com/auth/logging.write",
      "https://www.googleapis.com/auth/monitoring",
      "https://www.googleapis.com/auth/devstorage.read_only",
    ]
  }
}
```

Module after changes:
```
provider "google" {
  project = var.project
}

provider "google-beta" {
  project = var.project
}

data "google_container_engine_versions" "default" {
  provider       = google-beta
  for_each       = var.clusters
  location       = each.value.zone
  version_prefix = each.value.version_prefix
}

resource "google_container_cluster" "gke_cluster" {
  for_each = var.clusters

  name     = "${var.env}-ibp-${each.value.name}-cluster"
  project  = var.project
  location = each.value.zone

  min_master_version = data.google_container_engine_versions.default[each.key].latest_node_version
  release_channel {
    channel = "UNSPECIFIED"
  }

  remove_default_node_pool = true
  initial_node_count       = var.initial_node_count

  network    = var.env
  subnetwork = "${var.env}-subnet-${each.value.name}"

  ip_allocation_policy {
    cluster_secondary_range_name  = "${var.env}-subnet-${each.value.name}-sec-01"
    services_secondary_range_name = "${var.env}-subnet-${each.value.name}-sec-02"
  }
}

resource "google_container_node_pool" "node_pool" {
  for_each = var.clusters

  name       = "${var.env}-ibp-${each.value.name}-${random_string.node_pool_name_suffix[each.key].id}"
  project    = var.project
  location   = each.value.zone
  cluster    = google_container_cluster.gke_cluster[each.key].name
  node_count = var.initial_node_count
  version    = data.google_container_engine_versions.default[each.key].latest_node_version

  lifecycle {
    ignore_changes        = [node_count]
    create_before_destroy = true
  }

  node_config {
    preemptible  = var.preemptible_nodes
    machine_type = var.machine_type

    metadata = {
      disable-legacy-endpoints = "true"
    }

    oauth_scopes = [
      "https://www.googleapis.com/auth/logging.write",
      "https://www.googleapis.com/auth/monitoring",
      "https://www.googleapis.com/auth/devstorage.read_only",
    ]
  }

  depends_on = [
    random_string.node_pool_name_suffix,
  ]
}

resource "random_string" "node_pool_name_suffix" {
  for_each = var.clusters
  length   = 6
  special  = false
  upper    = false
  keepers = {
    machine_type = var.machine_type
    preemptible  = var.preemptible_nodes
  }
}

resource "null_resource" "node_pool_provisioner" {
  for_each = var.clusters

  triggers = {
    cluster        = "${var.env}-ibp-${each.value.name}-cluster"
    project        = var.project
    location       = each.value.zone
    node_pool      = "${var.env}-ibp-${each.value.name}-${random_string.node_pool_name_suffix[each.key].id}"
    drain_interval = var.drain_interval
  }

  provisioner "local-exec" {
    #working_dir = "${path.module}/scripts/"
    command = "${path.root}/scripts/drain-nodes.sh ${self.triggers.project} ${self.triggers.location} ${self.triggers.cluster} ${self.triggers.node_pool} ${self.triggers.drain_interval}"
  }

  depends_on = [
    google_container_node_pool.node_pool,
    random_string.node_pool_name_suffix,
  ]
}
```

Terraform apply with failure after module changes:
```
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_container_cluster.gke_cluster["reg1"] has been changed
  ~ resource "google_container_cluster" "gke_cluster" {
        id                          = "projects/my-nice-project/locations/northamerica-northeast1-a/clusters/my-nice-prefix-cluster"
        name                        = "my-nice-prefix-cluster"
      + resource_labels             = {}
        # (26 unchanged attributes hidden)

      + node_config {
          + disk_size_gb      = 100
          + disk_type         = "pd-standard"
          + guest_accelerator = []
          + image_type        = "COS_CONTAINERD"
          + labels            = {}
          + local_ssd_count   = 0
          + machine_type      = "e2-medium"
          + metadata          = {
              + "disable-legacy-endpoints" = "true"
            }
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/devstorage.read_only",
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
            ]
          + preemptible       = false
          + service_account   = "default"
          + spot              = false
          + tags              = []
          + taint             = []

          + shielded_instance_config {
              + enable_integrity_monitoring = true
              + enable_secure_boot          = false
            }
        }

      + node_pool {
          + initial_node_count          = 3
          + instance_group_urls         = [
              + "https://www.googleapis.com/compute/v1/projects/my-nice-project/zones/northamerica-northeast1-a/instanceGroupManagers/gke-my-nice-prefix-cl-my-nice-prefix-20-2bc07a60-grp",
            ]
          + managed_instance_group_urls = [
              + "https://www.googleapis.com/compute/v1/projects/my-nice-project/zones/northamerica-northeast1-a/instanceGroups/gke-my-nice-prefix-cl-my-nice-prefix-20-2bc07a60-grp",
            ]
          + max_pods_per_node           = 110
          + name                        = "my-nice-prefix-20220817151912534300000001"
          + node_count                  = 3
          + node_locations              = [
              + "northamerica-northeast1-a",
            ]
          + version                     = "1.22.8-gke.2200"

          + management {
              + auto_repair  = true
              + auto_upgrade = true
            }

          + node_config {
              + disk_size_gb      = 100
              + disk_type         = "pd-standard"
              + guest_accelerator = []
              + image_type        = "COS_CONTAINERD"
              + labels            = {}
              + local_ssd_count   = 0
              + machine_type      = "e2-medium"
              + metadata          = {
                  + "disable-legacy-endpoints" = "true"
                }
              + oauth_scopes      = [
                  + "https://www.googleapis.com/auth/devstorage.read_only",
                  + "https://www.googleapis.com/auth/logging.write",
                  + "https://www.googleapis.com/auth/monitoring",
                ]
              + preemptible       = false
              + service_account   = "default"
              + spot              = false
              + tags              = []
              + taint             = []

              + shielded_instance_config {
                  + enable_integrity_monitoring = true
                  + enable_secure_boot          = false
                }
            }

          + upgrade_settings {
              + max_surge       = 1
              + max_unavailable = 0
            }
        }


        # (12 unchanged blocks hidden)
    }
  # google_container_node_pool.node_pool["reg1"] has been changed
  ~ resource "google_container_node_pool" "node_pool" {
        id                          = "projects/my-nice-project/locations/northamerica-northeast1-a/clusters/my-nice-prefix-cluster/nodePools/my-nice-prefix-20220817151912534300000001"
        name                        = "my-nice-prefix-20220817151912534300000001"
        # (11 unchanged attributes hidden)


      ~ node_config {
          + tags              = []
            # (13 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
+/- create replacement and then destroy

Terraform will perform the following actions:

  # google_container_node_pool.node_pool["reg1"] must be replaced
+/- resource "google_container_node_pool" "node_pool" {
      ~ id                          = "projects/my-nice-project/locations/northamerica-northeast1-a/clusters/my-nice-prefix-cluster/nodePools/my-nice-prefix-20220817151912534300000001" -> (known after apply)
      ~ initial_node_count          = 3 -> (known after apply)
      ~ instance_group_urls         = [
          - "https://www.googleapis.com/compute/v1/projects/my-nice-project/zones/northamerica-northeast1-a/instanceGroupManagers/gke-my-nice-prefix-cl-my-nice-prefix-20-2bc07a60-grp",
        ] -> (known after apply)
      ~ managed_instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/my-nice-project/zones/northamerica-northeast1-a/instanceGroups/gke-my-nice-prefix-cl-my-nice-prefix-20-2bc07a60-grp",
        ] -> (known after apply)
      ~ max_pods_per_node           = 110 -> (known after apply)
      ~ name                        = "my-nice-prefix-20220817151912534300000001" -> (known after apply)
      ~ node_locations              = [
          - "northamerica-northeast1-a",
        ] -> (known after apply)
      + operation                   = (known after apply)
        # (6 unchanged attributes hidden)

      ~ management {
          ~ auto_repair  = true -> (known after apply)
          ~ auto_upgrade = true -> (known after apply)
        }

      ~ node_config {
          ~ disk_size_gb      = 100 -> (known after apply)
          ~ disk_type         = "pd-standard" -> (known after apply)
          ~ guest_accelerator = [] -> (known after apply)
          ~ image_type        = "COS_CONTAINERD" -> (known after apply)
          ~ labels            = {} -> (known after apply)
          ~ local_ssd_count   = 0 -> (known after apply)
          ~ machine_type      = "e2-medium" -> "e2-standard-4" # forces replacement
          + min_cpu_platform  = (known after apply)
          ~ service_account   = "default" -> (known after apply)
          - tags              = [] -> null
          ~ taint             = [] -> (known after apply)
            # (4 unchanged attributes hidden)

          ~ shielded_instance_config {
              ~ enable_integrity_monitoring = true -> (known after apply)
              ~ enable_secure_boot          = false -> (known after apply)
            }

          + workload_metadata_config {
              + mode = (known after apply)
            }
        }

      ~ upgrade_settings {
          ~ max_surge       = 1 -> (known after apply)
          ~ max_unavailable = 0 -> (known after apply)
        }
    }

  # null_resource.node_pool_provisioner["reg1"] will be created
  + resource "null_resource" "node_pool_provisioner" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # random_string.node_pool_name_suffix["reg1"] will be created
  + resource "random_string" "node_pool_name_suffix" {
      + id          = (known after apply)
      + keepers     = {
          + "machine_type" = "e2-standard-4"
          + "preemptible"  = "false"
        }
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 3 to add, 0 to change, 1 to destroy.

random_string.node_pool_name_suffix["reg1"]: Creating...
random_string.node_pool_name_suffix["reg1"]: Creation complete after 0s [id=eolg0x]
google_container_node_pool.node_pool["reg1"]: Creating...
google_container_node_pool.node_pool["reg1"]: Still creating... [10s elapsed]
google_container_node_pool.node_pool["reg1"]: Still creating... [20s elapsed]
google_container_node_pool.node_pool["reg1"]: Still creating... [30s elapsed]
google_container_node_pool.node_pool["reg1"]: Still creating... [40s elapsed]
google_container_node_pool.node_pool["reg1"]: Still creating... [50s elapsed]
google_container_node_pool.node_pool["reg1"]: Still creating... [1m0s elapsed]
google_container_node_pool.node_pool["reg1"]: Still creating... [1m10s elapsed]
google_container_node_pool.node_pool["reg1"]: Creation complete after 1m12s [id=projects/my-nice-project/locations/northamerica-northeast1-a/clusters/my-nice-prefix-cluster/nodePools/my-nice-prefix-20220817160943543600000001]
null_resource.node_pool_provisioner["reg1"]: Creating...
google_container_node_pool.node_pool["reg1"] (deposed object 840966d4): Destroying... [id=projects/my-nice-project/locations/northamerica-northeast1-a/clusters/my-nice-prefix-cluster/nodePools/my-nice-prefix-20220817151912534300000001]
null_resource.node_pool_provisioner["reg1"]: Provisioning with 'local-exec'...
null_resource.node_pool_provisioner["reg1"] (local-exec): Executing: ["/bin/sh" "-c" "./scripts/drain-nodes.sh my-nice-project northamerica-northeast1-a my-nice-prefix-cluster my-nice-prefix-eolg0x 30"]
null_resource.node_pool_provisioner["reg1"] (local-exec): /bin/sh: ./scripts/drain-nodes.sh: not found
google_container_node_pool.node_pool["reg1"]: Still destroying... [id=projects/my-nice-project/locations/no...refix-reg1-20220817151912534300000001, 10s elapsed]
google_container_node_pool.node_pool["reg1"]: Still destroying... [id=projects/my-nice-project/locations/no...refix-reg1-20220817151912534300000001, 20s elapsed]
google_container_node_pool.node_pool["reg1"]: Still destroying... [id=projects/my-nice-project/locations/no...refix-reg1-20220817151912534300000001, 30s elapsed]
google_container_node_pool.node_pool["reg1"]: Still destroying... [id=projects/my-nice-project/locations/no...refix-reg1-20220817151912534300000001, 40s elapsed]
google_container_node_pool.node_pool["reg1"]: Still destroying... [id=projects/my-nice-project/locations/no...refix-reg1-20220817151912534300000001, 50s elapsed]
google_container_node_pool.node_pool["reg1"]: Still destroying... [id=projects/my-nice-project/locations/no...refix-reg1-20220817151912534300000001, 1m0s elapsed]
google_container_node_pool.node_pool["reg1"]: Still destroying... [id=projects/my-nice-project/locations/no...refix-reg1-20220817151912534300000001, 1m10s elapsed]
google_container_node_pool.node_pool["reg1"]: Still destroying... [id=projects/my-nice-project/locations/no...refix-reg1-20220817151912534300000001, 1m20s elapsed]
google_container_node_pool.node_pool["reg1"]: Still destroying... [id=projects/my-nice-project/locations/no...refix-reg1-20220817151912534300000001, 1m30s elapsed]
google_container_node_pool.node_pool["reg1"]: Still destroying... [id=projects/my-nice-project/locations/no...refix-reg1-20220817151912534300000001, 1m40s elapsed]
google_container_node_pool.node_pool["reg1"]: Still destroying... [id=projects/my-nice-project/locations/no...refix-reg1-20220817151912534300000001, 1m50s elapsed]
google_container_node_pool.node_pool["reg1"]: Still destroying... [id=projects/my-nice-project/locations/no...refix-reg1-20220817151912534300000001, 2m0s elapsed]
google_container_node_pool.node_pool["reg1"]: Still destroying... [id=projects/my-nice-project/locations/no...refix-reg1-20220817151912534300000001, 2m10s elapsed]
google_container_node_pool.node_pool["reg1"]: Still destroying... [id=projects/my-nice-project/locations/no...refix-reg1-20220817151912534300000001, 2m20s elapsed]
google_container_node_pool.node_pool["reg1"]: Still destroying... [id=projects/my-nice-project/locations/no...refix-reg1-20220817151912534300000001, 2m30s elapsed]
google_container_node_pool.node_pool["reg1"]: Still destroying... [id=projects/my-nice-project/locations/no...refix-reg1-20220817151912534300000001, 2m40s elapsed]
google_container_node_pool.node_pool["reg1"]: Still destroying... [id=projects/my-nice-project/locations/no...refix-reg1-20220817151912534300000001, 2m50s elapsed]
google_container_node_pool.node_pool["reg1"]: Still destroying... [id=projects/my-nice-project/locations/no...refix-reg1-20220817151912534300000001, 3m0s elapsed]
google_container_node_pool.node_pool["reg1"]: Still destroying... [id=projects/my-nice-project/locations/no...refix-reg1-20220817151912534300000001, 3m10s elapsed]
google_container_node_pool.node_pool["reg1"]: Still destroying... [id=projects/my-nice-project/locations/no...refix-reg1-20220817151912534300000001, 3m20s elapsed]
google_container_node_pool.node_pool["reg1"]: Still destroying... [id=projects/my-nice-project/locations/no...refix-reg1-20220817151912534300000001, 3m30s elapsed]
google_container_node_pool.node_pool["reg1"]: Still destroying... [id=projects/my-nice-project/locations/no...refix-reg1-20220817151912534300000001, 3m40s elapsed]
google_container_node_pool.node_pool["reg1"]: Still destroying... [id=projects/my-nice-project/locations/no...refix-reg1-20220817151912534300000001, 3m50s elapsed]
google_container_node_pool.node_pool["reg1"]: Still destroying... [id=projects/my-nice-project/locations/no...refix-reg1-20220817151912534300000001, 4m0s elapsed]
google_container_node_pool.node_pool["reg1"]: Still destroying... [id=projects/my-nice-project/locations/no...refix-reg1-20220817151912534300000001, 4m10s elapsed]
google_container_node_pool.node_pool["reg1"]: Destruction complete after 4m11s
╷
│ Error: local-exec provisioner error
│ 
│   with null_resource.node_pool_provisioner["reg1"],
│   on main.tf line 98, in resource "null_resource" "node_pool_provisioner":
│   98:   provisioner "local-exec" {
│ 
│ Error running command './scripts/drain-nodes.sh my-nice-project
│ northamerica-northeast1-a my-nice-prefix-cluster my-nice-prefix-eolg0x 30':
│ exit status 127. Output: /bin/sh: ./scripts/drain-nodes.sh: not found
│ 
```